app/controllers/snippets_controller.rb

  def secret_snippets
    @snippets = current_user.snippets.private_snippet.order("created_at DESC")
---
SELECT "snippets".* FROM "snippets" WHERE "snippets"."user_id" = $1 AND "snippets"."private" = $2  ORDER BY created_at DESC  [["user_id", 1], ["private", "t"]]

  def create
    @snippet = Snippet.new(snippet_params)
    @snippet.user = current_user
      if @snippet.save
---
INSERT INTO "snippets" ("kind", "title", "code", "private", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @snippet.update(snippet_params)
---
UPDATE "snippets" SET "code" = $1, "updated_at" = $2 WHERE "snippets"."id" = $3  [["code", "# h1\r\n_Italics_\r\n*Bold*\r\n##### by Alaina Gully & Angela Ji"], ["updated_at", "2016-08-04 01:44:27.899608"], ["id", 4]]

    def find_snippet
      @snippet = Snippet.find(params[:id])
---
SELECT  "snippets".* FROM "snippets" WHERE "snippets"."id" = $1 LIMIT 1  [["id", 13]]